src/cf/InformationRegisters/СопоставлениеИдентификаторовМагазиновСоцСетей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СопоставлениеИдентификаторовМагазиновСоцСетей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ИнтеграцияСМагазинамиСоцСетей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ВиртуальныеКаталогиТоваровМагазиновСоцСетей</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатураПрисоединенныеФайлы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВиртуальныеКаталогиТоваровМагазиновСоцСетейПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипИдентификатора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НоменклатураХарактеристикДляМагазинаСоцСетей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураХарактеристикДляМагазинаСоцСетей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ИнтеграцияСМагазинамиСоцСетей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НоменклатураХарактеристикДляМагазинаСоцСетейВиртуальныеКаталоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураХарактеристикДляМагазинаСоцСетейВиртуальныеКаталоги</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ИнтеграцияСМагазинамиСоцСетей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВиртуальныйКаталог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВиртуальныеКаталогиТоваровМагазиновСоцСетей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Comment>Валюта цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВключаяХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУстановки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходыПредпринимателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ХешКонтролируемыхРеквизитовДляМагазинаСоцСетей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ХешКонтролируемыхРеквизитовДляМагазинаСоцСетей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Хеш</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ИнтеграцияСМагазинамиСоцСетей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ВиртуальныеКаталогиТоваровМагазиновСоцСетей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОстаткиТоваровМагазинаСоцСетей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОстаткиТоваровМагазинаСоцСетей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ИнтеграцияСМагазинамиСоцСетей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ОбменСВнешнимиСистемамиЛогированиеДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОбменСВнешнимиСистемамиЛогированиеДействия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаЗаказовИз1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаИзображенийИз1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаОстатковИз1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаТоваровИз1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаЦенИз1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаАтрибутовВ1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаАтрибутовЗначенияВ1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаЗаказовВ1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаИзображенийВ1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаОплатВ1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаОстатковВ1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаСкладовВ1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаТоваровВ1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаЦенВ1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросАвторизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеТоварногоКаталога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодборТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеЛимитовЗагрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеРекомендации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверкаСтатусаПубликации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварВАрхив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварДобавить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварИзАрхива</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварИзменить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварУдалить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ИнтеграцияСМагазинамиСоцСетейСервер/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСоответствиеИзJSON(СтрокаJSON = "",ЭтоПутьКФайлу = ложь) Экспорт
	
	Если СтрокаJSON = "" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	Если ЭтоПутьКФайлу Тогда
		ЧтениеJSON.ОткрытьФайл(СтрокаJSON);
	Иначе
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	КонецЕсли;
	
	Соответствие = ПрочитатьJSON(ЧтениеJSON, Истина);
	
	ЧтениеJSON.Закрыть();
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьЗначениеСоответствия(знач Соответствие, СтрокаКлюча) Экспорт
	
	Для Каждого СтрокаКлюч Из СтрРазделить(СтрокаКлюча, ".", Ложь) Цикл
		
		Соответствие = Соответствие.Получить(СтрокаКлюч);
		
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьJSONИзДанных(Структура) Экспорт
	
	Результат = "";
	
	Если Структура = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
		ЗаписатьJSON(ЗаписьJSON,Структура);
		
		Результат = ЗаписьJSON.Закрыть();
		
	Исключение
		
		ПроверитьУбратьNULL(Структура);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
		ЗаписатьJSON(ЗаписьJSON,Структура);
		
		Результат = ЗаписьJSON.Закрыть();
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьUnixTSИзДаты(ДатаВремя) Экспорт
	Возврат УниверсальноеВремя(ДатаВремя) - '19700101';
КонецФункции

Функция ПолучитьДатуИзUnixTS(UnixTime) Экспорт
	Возврат МестноеВремя('19700101' + UnixTime);
КонецФункции

Функция ПодготовитьHTTPЗапрос() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Сервер" , Неопределено);
	Результат.Вставить("Порт" , Неопределено);
	Результат.Вставить("Пользователь" , Неопределено);
	Результат.Вставить("Пароль" , Неопределено);
	Результат.Вставить("Прокси" , Неопределено);
	Результат.Вставить("Таймаут" , 600);
	Результат.Вставить("ЗащищенноеСоединение" , ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение());
	Результат.Вставить("HTTPСоединение" , Неопределено);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/json; charset=utf-8");
	Результат.Вставить("Заголовки" , Заголовки);
	
	Результат.Вставить("КодСостояния", 0);
	Результат.Вставить("ТелоОтвета", "");
	Результат.Вставить("ПрочитатьJSON", Истина);
	Результат.Вставить("ПрочтенУспешноJSON" , Ложь);
	Результат.Вставить("АдресРесурса" , Неопределено);
	Результат.Вставить("ИмяМетода" , "get");
	Результат.Вставить("ТелоЗапроса" , ""); 
	Результат.Вставить("ОшибкаHTTPЗапрос" , ""); 
	Результат.Вставить("ТипТелоЗапроса" , 1); //1 - Текст, 2 - ДД , 3 - Имя файла
	Результат.Вставить("ТипТелоОтвета", 1); //1 - Текст, 2 - ДД , 3 - Имя файла
	
	Результат.Вставить("ОбъектМетаданныхДляЖР" , "");
	Результат.Вставить("ДанныеДляЖР" , "");
	Результат.Вставить("СобытиеДляЖР" , "");
	
	Результат.Вставить("ТекстПроверкиДляПовторенияЗапроса" , "Too many requests per second");
	Результат.Вставить("ИнтервалОжиданияПередПовторением" , 2); // 1 секунда
	Результат.Вставить("СчетчикВызовов" , Новый Соответствие); // 
	Результат.Вставить("ОграничениеНаКоличествоВызововС" , 5); // 
	Результат.Вставить("ОбщийКэш" , Новый Соответствие); // 
	
	Возврат Результат;
	
КонецФункции // ПодготовитьHTTPЗапрос

Процедура ДобавитьЗаписьЖурналаРегистрацииОшибкаHTTPЗапроса(СтруктураHTTPЗапрос,ЭтоОшибка = Истина) Экспорт
	
	Если ЗначениеЗаполнено(СтруктураHTTPЗапрос.СобытиеДляЖР) Тогда
		
		ЗаписьЖурналаРегистрации(СтруктураHTTPЗапрос.СобытиеДляЖР
		,?(ЭтоОшибка,УровеньЖурналаРегистрации.Ошибка,УровеньЖурналаРегистрации.Предупреждение)
		,СтруктураHTTPЗапрос.ОбъектМетаданныхДляЖР
		,СтруктураHTTPЗапрос.ДанныеДляЖР
		,ЗначениеВСтрокуВнутр(СтруктураHTTPЗапрос)
		,РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьЗаписьЖурналаРегистрацииОшибкаHTTPЗапроса

Функция ЭтотЗапросУспешный(ОтветHTTP) Экспорт
	
	МассивУспешныхОтветов = Новый Массив;
	МассивУспешныхОтветов.Добавить(200);
	МассивУспешныхОтветов.Добавить(201);
	
	Результат = ОтветHTTP.КодСостояния >=200 И ОтветHTTP.КодСостояния < 300;
	
	Возврат Результат;
	
КонецФункции // ЭтотЗапросУспешный

Функция ВыполнитьHTTPЗапрос(СтруктураHTTPЗапрос, ПараметрыКонтекст = Неопределено) Экспорт
	
	ОтветHTTP = Неопределено;
	
	Попытка
		
		HTTPЗапрос = Новый HTTPЗапрос;
		
		Для Каждого КлючЗначение Из СтруктураHTTPЗапрос.Заголовки Цикл
			HTTPЗапрос.Заголовки.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
		
		HTTPЗапрос.АдресРесурса = СтруктураHTTPЗапрос.АдресРесурса; 
		
		Если СтруктураHTTPЗапрос.HTTPСоединение = Неопределено Тогда
			
			HTTPСоединение = Новый HTTPСоединение(СтруктураHTTPЗапрос.Сервер
			,СтруктураHTTPЗапрос.Порт
			,СтруктураHTTPЗапрос.Пользователь
			,СтруктураHTTPЗапрос.Пароль
			,СтруктураHTTPЗапрос.Прокси
			,СтруктураHTTPЗапрос.Таймаут
			,СтруктураHTTPЗапрос.ЗащищенноеСоединение);
			
			СтруктураHTTPЗапрос.Вставить("HTTPСоединение" , HTTPСоединение);
		Иначе
			HTTPСоединение = СтруктураHTTPЗапрос.HTTPСоединение;
		КонецЕсли;
		
		Если СтруктураHTTPЗапрос.ТипТелоЗапроса = 1 Тогда
			HTTPЗапрос.УстановитьТелоИзСтроки(СтруктураHTTPЗапрос.ТелоЗапроса , КодировкаТекста.UTF8);
		ИначеЕсли СтруктураHTTPЗапрос.ТипТелоЗапроса = 2 Тогда
			HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(СтруктураHTTPЗапрос.ТелоЗапроса);
		ИначеЕсли СтруктураHTTPЗапрос.ТипТелоЗапроса = 3 Тогда
			HTTPЗапрос.УстановитьИмяФайлаТела(СтруктураHTTPЗапрос.ТелоЗапроса);
		КонецЕсли; 
		
		
		УчетнаяЗапись = ОбменСВнешнимиСистемамиЛогирование.ПолучитьЗначениеПоля( ПараметрыКонтекст, "УчетнаяЗапись", Неопределено );
		Если ОбменСВнешнимиСистемамиЛогирование.ЛогированиеВключено( УчетнаяЗапись ) Тогда
			СтекВызоваСтр = ОбменСВнешнимиСистемамиЛогирование.СтекВызоваПолучить();
            
			HTTPМетод = ВРЕГ( СтруктураHTTPЗапрос.ИмяМетода );
			HTTPСоединениеПредставление = ОбменСВнешнимиСистемамиЛогирование.ОбъектПредставление( HTTPСоединение );
			
			HTTPЗапросПредставление = ОбменСВнешнимиСистемамиЛогирование.ОбъектПредставление( HTTPЗапрос, , ПараметрыКонтекст );
			
			СтруктураHTTPЗапросСервер = ОбменСВнешнимиСистемамиЛогирование.ПолучитьЗначениеПоля( СтруктураHTTPЗапрос, "Сервер", "" );
			
			ЛогКомментарий = НСтр("ru = 'HTTP: Запрос: Метод:'") + " " + HTTPМетод + ОбменСВнешнимиСистемамиЛогирование.КомментарийРазделительБлоков() 
			+ "СтруктураHTTPЗапрос.Сервер: <" + СтруктураHTTPЗапросСервер + ">" + ОбменСВнешнимиСистемамиЛогирование.КомментарийРазделительБлоков()
			+ HTTPЗапросПредставление + ОбменСВнешнимиСистемамиЛогирование.КомментарийРазделительБлоков()
			+ HTTPСоединениеПредставление + ОбменСВнешнимиСистемамиЛогирование.КомментарийРазделительБлоков()
			+ НСтр("ru = 'Стек вызовов:'") + Символы.ПС + СтекВызоваСтр;
			
			ПараметрыКонтекст_Действие = ОбменСВнешнимиСистемамиЛогирование.ПолучитьЗначениеПоля( ПараметрыКонтекст, "Действие", Неопределено );
			Если Не ЗначениеЗаполнено( ПараметрыКонтекст_Действие ) Тогда
				ПараметрыКонтекст_Действие = ЛогОпределитьДействиеПоАдресуРесурсаЗапроса( HTTPЗапрос.АдресРесурса );
			КонецЕсли;
			
			ЛогПараметры = Новый Структура;
			ЛогПараметры.Вставить( "Действие", ПараметрыКонтекст_Действие );
			ЛогПараметры.Вставить( "Сервер", HTTPСоединение.Сервер );
			ЛогПараметры.Вставить( "АдресРесурса", ОбменСВнешнимиСистемамиЛогирование.ЗаменитьИсключенияВСтроке( HTTPЗапрос.АдресРесурса ) );
			
			ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ЛогКомментарий, УчетнаяЗапись, , ЛогПараметры );
		КонецЕсли;
		
		СтруктураHTTPЗапрос.СчетчикВызовов.Вставить(ТекущаяУниверсальнаяДатаВМиллисекундах(),"");
		
		Если НРег(СтруктураHTTPЗапрос.ИмяМетода) = "get" Тогда
			ОтветHTTP = СтруктураHTTPЗапрос.HTTPСоединение.Получить(HTTPЗапрос);
		ИначеЕсли НРег(СтруктураHTTPЗапрос.ИмяМетода) = "post" Тогда
			ОтветHTTP = СтруктураHTTPЗапрос.HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		ИначеЕсли НРег(СтруктураHTTPЗапрос.ИмяМетода) = "put" Тогда
			ОтветHTTP = СтруктураHTTPЗапрос.HTTPСоединение.Записать(HTTPЗапрос);
		ИначеЕсли НРег(СтруктураHTTPЗапрос.ИмяМетода) = "delete" Тогда
			ОтветHTTP = СтруктураHTTPЗапрос.HTTPСоединение.Удалить(HTTPЗапрос);
		КонецЕсли; 


		Если ОбменСВнешнимиСистемамиЛогирование.ЛогированиеВключено( УчетнаяЗапись ) Тогда
            
			HTTPОтветПредставление = ОбменСВнешнимиСистемамиЛогирование.ОбъектПредставление( ОтветHTTP );
			
			ЛогКомментарий = НСтр("ru = 'HTTP: Ответ: Метод:'") + " " + HTTPМетод + ОбменСВнешнимиСистемамиЛогирование.КомментарийРазделительБлоков() 
			+ HTTPОтветПредставление + ОбменСВнешнимиСистемамиЛогирование.КомментарийРазделительБлоков()
			+ HTTPСоединениеПредставление + ОбменСВнешнимиСистемамиЛогирование.КомментарийРазделительБлоков()
			+ НСтр("ru = 'Стек вызовов:'") + Символы.ПС + СтекВызоваСтр;
			
			ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ЛогКомментарий, УчетнаяЗапись, , ЛогПараметры );
		КонецЕсли;
		
	Исключение
		
		СтруктураHTTPЗапрос.Вставить("ОшибкаHTTPЗапрос",ОписаниеОшибки());
		
		ДобавитьЗаписьЖурналаРегистрацииОшибкаHTTPЗапроса(СтруктураHTTPЗапрос,Истина);
		
	КонецПопытки;
	
	Возврат ОтветHTTP;
	
КонецФункции

Функция ВыполнитьHTTPЗапросОбработатьJSON(СтруктураHTTPЗапрос, ПараметрыКонтекст = Неопределено) Экспорт
	
	Результат = Неопределено; 
	
	Если СтруктураHTTPЗапрос.ОграничениеНаКоличествоВызововС <> 0 И
		СтруктураHTTPЗапрос.СчетчикВызовов.Количество() >= СтруктураHTTPЗапрос.ОграничениеНаКоличествоВызововС Тогда 
		
		ДатаВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах() - 100;
		
		МассивДляУдаления = Новый Массив;
		Для Каждого КлючЗначение Из СтруктураHTTPЗапрос.СчетчикВызовов Цикл
			Если КлючЗначение.Ключ <= ДатаВМиллисекундах Тогда
				МассивДляУдаления.Добавить(КлючЗначение.Ключ);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого КлючДляУдаления Из МассивДляУдаления Цикл
			СтруктураHTTPЗапрос.СчетчикВызовов.Удалить(КлючДляУдаления);
		КонецЦикла;
		
		Если СтруктураHTTPЗапрос.ОграничениеНаКоличествоВызововС <> 0 И
			СтруктураHTTPЗапрос.СчетчикВызовов.Количество() >= СтруктураHTTPЗапрос.ОграничениеНаКоличествоВызововС Тогда 
			Пауза(СтруктураHTTPЗапрос.ИнтервалОжиданияПередПовторением);
			
			СтруктураHTTPЗапрос.СчетчикВызовов.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	ОтветHTTP = ВыполнитьHTTPЗапрос(СтруктураHTTPЗапрос, ПараметрыКонтекст );
	
	Если ОтветHTTP <> Неопределено Тогда
		
		Если СтруктураHTTPЗапрос.ТипТелоОтвета = 1 Тогда
			СтруктураHTTPЗапрос.Вставить("ТелоОтвета" , ОтветHTTP.ПолучитьТелоКакСтроку());
			
			ПроверитьПовторитьОперацию(ОтветHTTP, СтруктураHTTPЗапрос);
			
		ИначеЕсли СтруктураHTTPЗапрос.ТипТелоОтвета = 2 Тогда
			СтруктураHTTPЗапрос.Вставить("ТелоОтвета" , ОтветHTTP.ПолучитьТелоКакДвоичныеДанные());
		ИначеЕсли СтруктураHTTPЗапрос.ТипТелоОтвета = 3 Тогда
			СтруктураHTTPЗапрос.Вставить("ТелоОтвета" , ОтветHTTP.ПолучитьИмяФайлаТела());
		КонецЕсли; 
		
		СтруктураHTTPЗапрос.Вставить("КодСостояния" , ОтветHTTP.КодСостояния);
		
		Если ЭтотЗапросУспешный(ОтветHTTP) Тогда
			
			Результат = СтруктураHTTPЗапрос.ТелоОтвета;
			
			Если СтруктураHTTPЗапрос.ПрочитатьJSON Тогда
				Попытка
					Результат = ПолучитьСоответствиеИзJSON(Результат);
					СтруктураHTTPЗапрос.ПрочтенУспешноJSON = Истина;
				Исключение
					Результат = Неопределено;
				КонецПопытки;
			КонецЕсли;
			
		Иначе
			
			ДобавитьЗаписьЖурналаРегистрацииОшибкаHTTPЗапроса(СтруктураHTTPЗапрос,Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьПовторитьОперацию(ОтветHTTP, СтруктураHTTPЗапрос)
	
	Если НЕ ПустаяСтрока(СтруктураHTTPЗапрос.ТекстПроверкиДляПовторенияЗапроса)
		И СтрНайти(СтруктураHTTPЗапрос.ТелоОтвета, СтруктураHTTPЗапрос.ТекстПроверкиДляПовторенияЗапроса) <> 0 Тогда
		
		Пауза(СтруктураHTTPЗапрос.ИнтервалОжиданияПередПовторением);
		
		ОтветHTTP = ВыполнитьHTTPЗапрос(СтруктураHTTPЗапрос);
		
		СтруктураHTTPЗапрос.Вставить("ТелоОтвета" , ОтветHTTP.ПолучитьТелоКакСтроку());
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СтруктураHTTPЗапрос.ТекстПроверкиДляПовторенияЗапроса)
		И СтрНайти(СтруктураHTTPЗапрос.ТелоОтвета, СтруктураHTTPЗапрос.ТекстПроверкиДляПовторенияЗапроса) <> 0 Тогда
		
		Пауза(СтруктураHTTPЗапрос.ИнтервалОжиданияПередПовторением + СтруктураHTTPЗапрос.ИнтервалОжиданияПередПовторением);
		
		ОтветHTTP = ВыполнитьHTTPЗапрос(СтруктураHTTPЗапрос);
		
		СтруктураHTTPЗапрос.Вставить("ТелоОтвета" , ОтветHTTP.ПолучитьТелоКакСтроку());
		
	КонецЕсли;

КонецПроцедуры // ВыполнитьОбработатьЗапрос

Процедура ПроверитьУбратьNULL(ПроизвольноеЗначение)
	
	Если ТипЗнч(ПроизвольноеЗначение) = Тип("Массив") Тогда
		Для Каждого Стр Из ПроизвольноеЗначение Цикл
			ПроверитьУбратьNULL(Стр);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ПроизвольноеЗначение) = Тип("Структура") Или ТипЗнч(ПроизвольноеЗначение) = Тип("Соответствие")Тогда
		Для Каждого КлючЗначение Из ПроизвольноеЗначение Цикл
			ТекЗнач = КлючЗначение.Значение;
			ПроверитьУбратьNULL(ТекЗнач);
			ПроизвольноеЗначение.Вставить(КлючЗначение.Ключ,ТекЗнач);
		КонецЦикла;
	Иначе
		
		Если ПроизвольноеЗначение = null Тогда
			ПроизвольноеЗначение = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСоответствиеКукиИзЗаголовков(Заголовки) Экспорт
	
	Соответствие = Новый Соответствие;
	
	СтрокаЗначений = ПолучитьЗначениеЗаголовка(Заголовки,"Cookie");
	
	Если СтрокаЗначений <> Неопределено Тогда
		
		МассивПар = СтрРазделить(СтрокаЗначений,";",Ложь);
		
		Для Каждого СтрПара Из МассивПар Цикл
			
			СтрПара = СокрЛП(СтрПара);
			
			НомерВхождения = СтрНайти(СтрПара,"=",НаправлениеПоиска.СНачала);
			
			Если НомерВхождения = 0 Тогда
				Соответствие.Вставить(СтрПара);
			Иначе
				ИмяПараметра= Сред(СтрПара,1,НомерВхождения-1);
				ЗначениеПараметра = Прав(СтрПара,СтрДлина(СтрПара) - НомерВхождения);
				
				Соответствие.Вставить(ИмяПараметра,ЗначениеПараметра);
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Соответствие;
	
КонецФункции  

Функция ПолучитьЗначениеЗаголовка(Заголовки,Ключ) Экспорт
	
	Результат = Заголовки.Получить(Ключ);
	Если Результат = Неопределено Тогда
		Результат = Заголовки.Получить(НРег(Ключ));
		Если Результат = Неопределено Тогда
			Для Каждого КлючЗначение Из Заголовки Цикл	
				Если НРег(КлючЗначение.Ключ) = НРег(Ключ) Тогда
					Результат = КлючЗначение.Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьНаТипЗначение(знач ПроверяемоеЗначение,ТипЗначения,ЗначениеПоУмолчанию) Экспорт
	
	Результат = ЗначениеПоУмолчанию;
	
	Если ПроверяемоеЗначение <> Неопределено Тогда
		Если ТипЗнч(ПроверяемоеЗначение) = ТипЗначения Тогда
			Результат = ПроверяемоеЗначение; 
		Иначе
			Если ТипЗначения = Тип("Число") Тогда
				Попытка
					ЧислоСтрокой = СтрЗаменить(ПроверяемоеЗначение,",",".");
					ЧислоСтрокой = СтрЗаменить(ПроверяемоеЗначение," ","");
					Результат = Число(ЧислоСтрокой);
				Исключение
					Результат = ЗначениеПоУмолчанию;
				КонецПопытки;
			ИначеЕсли ТипЗначения = Тип("Булево") Тогда
				
				Если НРег(ПроверяемоеЗначение) = "on" Тогда
					Результат = Истина;
				Иначе
					Попытка
						Результат = Булево(ПроверяемоеЗначение);
					Исключение
						Результат = ЗначениеПоУмолчанию;
					КонецПопытки;
				КонецЕсли;
			ИначеЕсли ТипЗначения = Тип("Массив") И ТипЗнч(ПроверяемоеЗначение) = Тип("Строка") Тогда
				Результат = СтрРазделить(ПроверяемоеЗначение,",",Ложь);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьХешСтроки(знач СтрокаДанных,ПреобразоватьВHEX = Истина,ПеревестиВНижнийРегистр = Истина) Экспорт
	
	Если ТипЗнч(СтрокаДанных) <> Тип("Строка") Тогда 
		СтрокаДанных = "";
	КонецЕсли;
	
	Возврат ПолучитьХешФайла(ПолучитьДвоичныеДанныеИзСтроки(СтрокаДанных,КодировкаТекста.UTF8),ПреобразоватьВHEX,ПеревестиВНижнийРегистр);
	
КонецФункции

Функция ПолучитьХешФайла(ДвоичныеДанные,ПреобразоватьВHEX = Истина,ПеревестиВНижнийРегистр = Истина) Экспорт
	
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
	ХешированиеДанных.Добавить(ДвоичныеДанные);
	
	ХешСумма = ХешированиеДанных.ХешСумма;
	
	Если ПреобразоватьВHEX Тогда
		ХешСумма = ПолучитьHexСтрокуИзДвоичныхДанных(ХешСумма);
	КонецЕсли;
	
	Если ПеревестиВНижнийРегистр Тогда
		ХешСумма = НРег(ХешСумма);
	КонецЕсли;
	
	Возврат ХешСумма;
	
КонецФункции

// Останавливает выполнение кода на заданное время.
//
// Параметры:
// КоличествоСекунд - Число - время ожидания в секундах. указывать значение меньше 0.001 не имеет смысла
//
Процедура Пауза(КоличествоСекунд = 5) Экспорт
	
	Если ТипЗнч(КоличествоСекунд) <> Тип("Число") Или КоличествоСекунд <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	ФоновоеЗадание = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
	
	Если ФоновоеЗадание = Неопределено Тогда
		Параметры = Новый Массив(1);
		Параметры[0] = КоличествоСекунд;
		ФоновоеЗадание = РасширенияКонфигурации.ВыполнитьФоновоеЗаданиеБезРасширений("ИнтеграцияСМагазинамиСоцСетейСервер.Пауза",Параметры,,"ИнтеграцияСМагазинамиСоцСетейСервер_Пауза");
		ФоновоеЗадание.ОжидатьЗавершенияВыполнения(КоличествоСекунд); 
		Параметры = Неопределено;
	Иначе
		ФоновоеЗадание.ОжидатьЗавершенияВыполнения(КоличествоСекунд);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьОбменВФоне(СсылкаНаУзелОбмена) Экспорт
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
	Метаданные.РегламентныеЗадания.ОбменСМагазинамиСоцСетей);
	
	ПланыОбмена.ИнтеграцияСМагазинамиСоцСетей.ВыполнитьОбменИнтерактивно(СсылкаНаУзелОбмена, Ложь, Истина);
КонецПроцедуры

Функция ЭтоКорректныйEmail(знач Адрес) Экспорт
	
	///////////////////////
	// Используется решение https://infostart.ru/public/192489/
	//////////////////////
	
	// Адрес = "test@me@gmail.narod.am";
	
	ЛатинскиеБуквы = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ";
	Цифры = "0123456789";
	
	// Ищем крайний справа символ @ для правильного выделения локальной и доменной части
	ИндексСобаки = СтрНайти(Адрес,"@");
	
	// 1. строка адреса вообще не содержит разделителя
	Если ИндексСобаки = 0 Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	УрезаемаяСтрока = Сред(Адрес, ИндексСобаки+1);
	
	Пока СтрНайти(УрезаемаяСтрока,"@") > 0 Цикл
		
		ИндексСобаки= ИндексСобаки + СтрНайти(УрезаемаяСтрока,"@");
		УрезаемаяСтрока = Сред(УрезаемаяСтрока, ИндексСобаки+1);
		
	КонецЦикла;
	
	ДоменнаяЧасть= Сред(Адрес, ИндексСобаки+1);
	ЛокальнаяЧасть = Лев(Адрес, ИндексСобаки-1);
	
	// 2. Проверяем длину локальной части
	Если СтрДлина(ЛокальнаяЧасть) < 1 ИЛИ СтрДлина(ЛокальнаяЧасть) > 64 Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	// 3. Проверяем длину доменной части
	Если СтрДлина(ДоменнаяЧасть) < 1 ИЛИ СтрДлина(ДоменнаяЧасть) > 255 Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	// 4. Проверяем что локальная части не начинается и не заканчивается на "."
	Если Лев(ЛокальнаяЧасть, 1) = "." ИЛИ Прав(ЛокальнаяЧасть, 1) = "." Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	// 5. Локальная части не содержит 2 или более "." подряд
	Если СтрНайти(ЛокальнаяЧасть, "..") > 0 Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	// Проверка доменной части
	// 6. Доменная часть не начинается с точки
	Если Лев(ДоменнаяЧасть, 1) = "." Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	// 7. Доменная часть не содержит 2 или более "." подряд
	Если СтрНайти(ДоменнаяЧасть, "..") > 0 Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	// 8. Доменная часть не заканчивается на "."
	Если Прав(ДоменнаяЧасть, 1) = "." Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	// 9. Проверка частей доменной части
	// каждая часть начинается с буквы и заканчивается буквой или цифрой
	// каждая часть длиной не более 63 символов
	// минимум 2 части
	ИдентификаторыДоменнойЧасти = СтрРазделить(ДоменнаяЧасть, ".",Ложь);
	
	Если ИдентификаторыДоменнойЧасти.Количество() < 2 Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	Для Каждого ИдентификаторДомена Из ИдентификаторыДоменнойЧасти Цикл
		
		Если СтрДлина(ИдентификаторДомена) > 63 Тогда
			Возврат ЛОЖЬ;
		КонецЕсли;
		
		Если СтрНайти(ЛатинскиеБуквы, Лев(ИдентификаторДомена,1)) = 0
			
			// для доменов, нарушающих RFC 1035 п.2.3.1, например @1c.ru :)
			И СтрНайти(Цифры, Лев(ИдентификаторДомена,1)) = 0
			Тогда

			Возврат ЛОЖЬ;
		КонецЕсли;
		
		Если СтрНайти(ЛатинскиеБуквы, Прав(ИдентификаторДомена,1)) = 0
		И СтрНайти(Цифры, Прав(ИдентификаторДомена,1)) = 0 Тогда
			Возврат ЛОЖЬ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИСТИНА;
	
КонецФункции

// См. РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий.
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОбменСМагазинамиСоцСетей;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
КонецПроцедуры

Функция ПолучитьРасписаниеРегламентногоЗаданияПоУмолчанию() Экспорт
	
	РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
	РасписаниеРегламентногоЗадания.ПериодПовтораВТечениеДня = 900;// 15 минут
	РасписаниеРегламентногоЗадания.ПериодПовтораДней = 1; // каждый день
	
	Возврат РасписаниеРегламентногоЗадания;
	
КонецФункции

Функция ЛогОпределитьДействиеПоАдресуРесурсаЗапроса( АдресРесурса )
	
	Если СтрНайти( АдресРесурса, "method/execute" ) > 0 
	И СтрНайти( АдресРесурса, "API.market.edit" ) > 0 Тогда
	
		Возврат Перечисления.ОбменСВнешнимиСистемамиЛогированиеДействия.ВыгрузкаТоваровИз1С;
	
	ИначеЕсли СтрНайти( АдресРесурса, "method/photos.getMarketUploadServer" ) > 0 Тогда
	
		Возврат Перечисления.ОбменСВнешнимиСистемамиЛогированиеДействия.ВыгрузкаИзображенийИз1С;
		
	ИначеЕсли СтрНайти( АдресРесурса, "method/photos.saveMarketPhoto" ) > 0 Тогда
	
		Возврат Перечисления.ОбменСВнешнимиСистемамиЛогированиеДействия.ВыгрузкаИзображенийИз1С;
		
	ИначеЕсли СтрНайти( АдресРесурса, "method/market.getGroupOrders" ) > 0 Тогда
	
		Возврат Перечисления.ОбменСВнешнимиСистемамиЛогированиеДействия.ЗагрузкаЗаказовВ1С;
		
	ИначеЕсли СтрНайти( АдресРесурса, "method/groups.get" ) > 0 Тогда
	
		Возврат Перечисления.ОбменСВнешнимиСистемамиЛогированиеДействия.Прочее;
		
	КонецЕсли;
	
	Возврат Перечисления.ОбменСВнешнимиСистемамиЛогированиеДействия.Прочее;
	
КонецФункции

Процедура СопоставлениеИдентификаторовМагазиновСоцСетейПоИдентификаторуУдалить( СсылкаНаУзелОбмена, ТипИдентификатора, Идентификатор ) Экспорт
	
	ЗапросТекст = 
	"ВЫБРАТЬ
	|	СопоставлениеИдентификаторовМагазиновСоцСетей.УзелИнформационнойБазы КАК УзелИнформационнойБазы,
	|	СопоставлениеИдентификаторовМагазиновСоцСетей.Ссылка КАК Ссылка,
	|	СопоставлениеИдентификаторовМагазиновСоцСетей.ТипИдентификатора КАК ТипИдентификатора,
	|	СопоставлениеИдентификаторовМагазиновСоцСетей.Идентификатор КАК Идентификатор,
	|	СопоставлениеИдентификаторовМагазиновСоцСетей.ДатаЗагрузки КАК ДатаЗагрузки
	|ИЗ
	|	РегистрСведений.СопоставлениеИдентификаторовМагазиновСоцСетей КАК СопоставлениеИдентификаторовМагазиновСоцСетей
	|ГДЕ
	|	СопоставлениеИдентификаторовМагазиновСоцСетей.УзелИнформационнойБазы = &СсылкаНаУзелОбмена
	|	И СопоставлениеИдентификаторовМагазиновСоцСетей.ТипИдентификатора = &ТипИдентификатора
	|	И СопоставлениеИдентификаторовМагазиновСоцСетей.Идентификатор = &Идентификатор";
	
	ЗапросОбъект = Новый Запрос( ЗапросТекст );
	
	ЗапросОбъект.УстановитьПараметр( "СсылкаНаУзелОбмена", СсылкаНаУзелОбмена );
	ЗапросОбъект.УстановитьПараметр( "ТипИдентификатора", ТипИдентификатора );
	ЗапросОбъект.УстановитьПараметр( "Идентификатор", Идентификатор );
	
	ЗапросВыборка = ЗапросОбъект.Выполнить().Выбрать();
	Если ЗапросВыборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.СопоставлениеИдентификаторовМагазиновСоцСетей.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.УзелИнформационнойБазы.Установить( СсылкаНаУзелОбмена );
	НаборЗаписей.Отбор.ТипИдентификатора.Установить( ТипИдентификатора );

	Пока ЗапросВыборка.Следующий() Цикл
		
		НаборЗаписей.Отбор.Ссылка.Установить( ЗапросВыборка.Ссылка );
		НаборЗаписей.Записать( Истина );
		
	КонецЦикла;

КонецПроцедуры

#Область АвторизацияVKID

// https://id.vk.com/about/business/go/docs/ru/vkid/latest/vk-id/connection/api-description
// code - действует 10 минут
// access_token - действует 1 час
// refresh_token - обновляет пару access_token и refresh_token

Процедура АвторизацияVKIDПараметрыЗаполнитьПоУмолчанию( Результат, ИдентификаторПриложения ) Экспорт

	Результат.СпособАвторизации = ИнтеграцияСМагазинамиСоцСетейКлиентСервер.СпособАвторизацииVKID();
	
	Результат.client_id = Формат( ИдентификаторПриложения, "ЧГ=0" ); // идентификатор приложения
	Результат.redirect_uri = "https://oauth.vk.com/blank.html"; // адрес перенаправления, должен совпадать с настройками приложения
	Результат.state = АвторизацияVKIDStateПолучить(); // произвольная строка состояния
	Результат.scope = "groups,market,photos,offline,docs"; // список доступов

	Результат.code_verifier = АвторизацияVKIDCodeVerifierНовый(); // параметр для защиты передаваемых данных
	Результат.code_challenge = АвторизацияVKIDCodeChallengeПолучить( Результат.code_verifier ); // преобразованный code_verifier
	Результат.code_challenge_method = "S256"; // метод преобразования code_verifier

	АвторизацияСтрокаURL = 
	"https://id.vk.com/authorize?response_type=code"
	+ "&client_id=" + Результат.client_id
	+ "&redirect_uri=" + Результат.redirect_uri
	+ "&state=" + Результат.state
	+ "&code_challenge=" + Результат.code_challenge
	+ "&code_challenge_method=" + Результат.code_challenge_method
	+ "&scope=" + Результат.scope;
	
	Результат.АвторизацияСтрокаURL = АвторизацияСтрокаURL;
	
КонецПроцедуры

Функция АвторизацияVKIDИмяСервера()
	Возврат "id.vk.com";
КонецФункции

Функция АвторизацияVKIDАдресРесурса()
	Возврат "oauth2/auth";
КонецФункции

Функция АвторизацияVKIDStateПолучить()

	Результат = Строка( Новый УникальныйИдентификатор );

	Возврат Результат;
КонецФункции

Функция АвторизацияVKIDCodeChallengeПолучить( Знач Значение )

	Результат = ИнтеграцияИС.ХешированиеДанныхSHA256( Значение );
	
	Результат = СтрЗаменить( Результат, "=", "" );
	Результат = СтрЗаменить( Результат, "+", "-" );
	Результат = СтрЗаменить( Результат, "/", "_" );

	Возврат Результат;
КонецФункции

Функция АвторизацияVKIDCodeVerifierНовый()

	Результат = Строка( Новый УникальныйИдентификатор )	+ Строка( Новый УникальныйИдентификатор );
	
	Возврат Результат;
КонецФункции

Функция АвторизацияVKIDПоменятьКодНаТокен( АвторизацияVKIDПараметры ) Экспорт
	
	Таймаут = 10;
	Заголовки = Новый Соответствие;
	Заголовки.Вставить( "Content-Type", "application/x-www-form-urlencoded" );
	Соединение = Новый HTTPСоединение( АвторизацияVKIDИмяСервера(), , , , , Таймаут, Новый ЗащищенноеСоединениеOpenSSL );
	
	ЗапросТело = 
	"grant_type=authorization_code"
	+ "&code_verifier=" + АвторизацияVKIDПараметры.code_verifier
	+ "&redirect_uri=" + АвторизацияVKIDПараметры.redirect_uri
	+ "&code=" + АвторизацияVKIDПараметры.code
	+ "&client_id=" + АвторизацияVKIDПараметры.client_id
	+ "&device_id=" + АвторизацияVKIDПараметры.device_id
	+ "&state=" + АвторизацияVKIDПараметры.state;
	
	HTTPЗапрос = Новый HTTPЗапрос( АвторизацияVKIDАдресРесурса(), Заголовки );
	
	HTTPЗапрос.УстановитьТелоИзСтроки( ЗапросТело );

	HTTPОтвет = Соединение.ОтправитьДляОбработки( HTTPЗапрос );
	HTTPОтветТелоКакСтрока = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ОтветДанные = JSONВДанные( HTTPОтветТелоКакСтрока );

	Если ОтветДанные.Свойство( "error" ) Тогда
	
		ОшибкаТекстДополнение = 
		ОбменСВнешнимиСистемамиЛогирование.БазаЗнанийСовпаденияНайтиСтрокойПолучить(
		"ВКонтакте: " + ОтветДанные.error_description );
		
		ОшибкаТекстДополнение = ОшибкаТекстДополнение + ?(ПустаяСтрока( ОшибкаТекстДополнение ), "", " " )
		+ НСтр( "ru = 'Ответ сайта ВКонтакте'" );
	
		ОшибкаШаблон = НСтр( "ru = 'Ошибка при обновлении токена доступа ВКонтакте: %1: %2: %3'" );
		ОшибкаТекст = СтрШаблон( ОшибкаШаблон, ОшибкаТекстДополнение, ОтветДанные.error, ОтветДанные.error_description );
		
		ОбщегоНазначения.СообщитьПользователю( ОшибкаТекст );
		
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ОшибкаТекст, АвторизацияVKIDПараметры.УчетнаяЗапись, Истина );
		
	КонецЕсли;
	
	Возврат ОтветДанные;
КонецФункции

Функция АвторизацияVKIDОбновитьТокенПоТокенуОбновления( АвторизацияVKIDПараметры ) Экспорт
	
	Таймаут = 10;
	Заголовки = Новый Соответствие;
	Заголовки.Вставить( "Content-Type", "application/x-www-form-urlencoded" );
	Соединение = Новый HTTPСоединение( АвторизацияVKIDИмяСервера(), , , , , Таймаут, Новый ЗащищенноеСоединениеOpenSSL );
	
	ЗапросТело = 
	"grant_type=refresh_token"
	+ "&refresh_token=" + АвторизацияVKIDПараметры.refresh_token
	+ "&client_id=" + АвторизацияVKIDПараметры.client_id
	+ "&device_id=" + АвторизацияVKIDПараметры.device_id
	+ "&state=" + АвторизацияVKIDПараметры.state;
	
	HTTPЗапрос = Новый HTTPЗапрос( АвторизацияVKIDАдресРесурса(), Заголовки );
	
	HTTPЗапрос.УстановитьТелоИзСтроки( ЗапросТело );

	HTTPОтвет = Соединение.ОтправитьДляОбработки( HTTPЗапрос );
	HTTPОтветТелоКакСтрока = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ОтветДанные = JSONВДанные( HTTPОтветТелоКакСтрока );
	
	Возврат ОтветДанные;
КонецФункции

Процедура АвторизацияVKIDТокенДоступаОбновить( ОписаниеУзелОбмена ) Экспорт

	УчетнаяЗапись = ОписаниеУзелОбмена.Ссылка;
	
	АвторизацияПараметры = ИнтеграцияСМагазинамиСоцСетейКлиентСервер.АвторизацияВКонтактеПараметрыНовый(
	ИнтеграцияСМагазинамиСоцСетейКлиентСервер.СпособАвторизацииVKID() );
	
	АвторизацияВКонтактеПараметрыИзБезопасногоХранилищеПолучить( УчетнаяЗапись, АвторизацияПараметры );
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	
	ОтветДанные = АвторизацияVKIDОбновитьТокенПоТокенуОбновления( АвторизацияПараметры );

	Если ОтветДанные.Свойство( "error" ) Тогда
	
		ОшибкаТекстДополнение = 
		ОбменСВнешнимиСистемамиЛогирование.БазаЗнанийСовпаденияНайтиСтрокойПолучить(
		"ВКонтакте: " + ОтветДанные.error_description );
		
		ОшибкаТекстДополнение = ОшибкаТекстДополнение + ?(ПустаяСтрока( ОшибкаТекстДополнение ), "", " " )
		+ НСтр( "ru = 'Ответ сайта ВКонтакте'" );
	
		ОшибкаШаблон = НСтр( "ru = 'Ошибка при обновлении токена доступа ВКонтакте: %1: %2: %3'" );
		ОшибкаТекст = СтрШаблон( ОшибкаШаблон, ОшибкаТекстДополнение, ОтветДанные.error, ОтветДанные.error_description );
		
		ОбщегоНазначения.СообщитьПользователю( ОшибкаТекст );
		
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ОшибкаТекст, УчетнаяЗапись, Истина );
		
		Возврат;
	КонецЕсли;
	
	АвторизацияПараметры.access_token = ОтветДанные.access_token;
	АвторизацияПараметры.refresh_token = ОтветДанные.refresh_token;
	АвторизацияПараметры.ОкончанияДействияТокенаДоступа = ТекущаяДатаСеанса + ОтветДанные.expires_in;
	
	АвторизацияВКонтактеПараметрыВБезопасноеХранилищеЗаписать( УчетнаяЗапись, АвторизацияПараметры );
	
	ОписаниеУзелОбмена.ТокенДоступа = АвторизацияПараметры.access_token;
	ОписаниеУзелОбмена.ОкончанияДействияТокенаДоступа = АвторизацияПараметры.ОкончанияДействияТокенаДоступа;
	
КонецПроцедуры

Функция JSONВДанные(СтрокаJSON, ПрочитатьВСоответствие = Ложь, ИменаСвойствСоЗначениямиДата = Неопределено)

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку( СтрокаJSON );
	Результат = ПрочитатьJSON( ЧтениеJSON, ПрочитатьВСоответствие, ИменаСвойствСоЗначениямиДата);
	ЧтениеJSON.Закрыть();

	Возврат Результат;

КонецФункции

#КонецОбласти

Процедура ЗарегистрироватьВсеДанныеКОбменуНаСервере(УзелИнформационнойБазы, ТолькоЦенаИКоличество = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураХарактеристикДляМагазинаСоцСетей.Номенклатура КАК СсылкаДанные
		|ИЗ
		|	РегистрСведений.НоменклатураХарактеристикДляМагазинаСоцСетей КАК НоменклатураХарактеристикДляМагазинаСоцСетей
		|ГДЕ
		|	НЕ &ТолькоЦенаИКоличество
		|			И НоменклатураХарактеристикДляМагазинаСоцСетей.УзелИнформационнойБазы = &УзелИнформационнойБазы
		|	И НоменклатураХарактеристикДляМагазинаСоцСетей.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НоменклатураХарактеристикДляМагазинаСоцСетей.Характеристика
		|ИЗ
		|	РегистрСведений.НоменклатураХарактеристикДляМагазинаСоцСетей КАК НоменклатураХарактеристикДляМагазинаСоцСетей
		|ГДЕ
		|	НЕ &ТолькоЦенаИКоличество
		|			И НоменклатураХарактеристикДляМагазинаСоцСетей.УзелИнформационнойБазы = &УзелИнформационнойБазы
		|	И НоменклатураХарактеристикДляМагазинаСоцСетей.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НоменклатураХарактеристикДляМагазинаСоцСетейВиртуальныеКаталоги.ВиртуальныйКаталог
		|ИЗ
		|	РегистрСведений.НоменклатураХарактеристикДляМагазинаСоцСетейВиртуальныеКаталоги КАК НоменклатураХарактеристикДляМагазинаСоцСетейВиртуальныеКаталоги
		|ГДЕ
		|	НЕ &ТолькоЦенаИКоличество
		|			И НоменклатураХарактеристикДляМагазинаСоцСетейВиртуальныеКаталоги.УзелИнформационнойБазы = &УзелИнформационнойБазы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Период КАК Период,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦен КАК ВидЦен,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			,
		|			ВидЦен В
		|					(ВЫБРАТЬ
		|						ИнтеграцияСМагазинамиСоцСетей.ВидЦеныНоменклатуры КАК ВидЦены
		|					ИЗ
		|						ПланОбмена.ИнтеграцияСМагазинамиСоцСетей КАК ИнтеграцияСМагазинамиСоцСетей
		|					ГДЕ
		|						ИнтеграцияСМагазинамиСоцСетей.Ссылка = &УзелИнформационнойБазы
		|			
		|					ОБЪЕДИНИТЬ ВСЕ
		|			
		|					ВЫБРАТЬ
		|						ИнтеграцияСМагазинамиСоцСетей.ВидЦеныНоменклатурыСтарая
		|					ИЗ
		|						ПланОбмена.ИнтеграцияСМагазинамиСоцСетей КАК ИнтеграцияСМагазинамиСоцСетей
		|					ГДЕ
		|						ИнтеграцияСМагазинамиСоцСетей.Ссылка = &УзелИнформационнойБазы)
		|				И (Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						НоменклатураХарактеристикДляМагазинаСоцСетей.Номенклатура КАК Номенклатура,
		|						НоменклатураХарактеристикДляМагазинаСоцСетей.Характеристика КАК Характеристика
		|					ИЗ
		|						РегистрСведений.НоменклатураХарактеристикДляМагазинаСоцСетей КАК НоменклатураХарактеристикДляМагазинаСоцСетей
		|					ГДЕ
		|						НоменклатураХарактеристикДляМагазинаСоцСетей.УзелИнформационнойБазы = &УзелИнформационнойБазы)) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", УзелИнформационнойБазы);
	Запрос.УстановитьПараметр("ТолькоЦенаИКоличество", ТолькоЦенаИКоличество);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если НЕ ТолькоЦенаИКоличество Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса[0].Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(УзелИнформационнойБазы, ВыборкаДетальныеЗаписи.СсылкаДанные);
		КонецЦикла;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса[1].Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
		НаборЗаписей.Отбор.ВидЦен.Установить(ВыборкаДетальныеЗаписи.ВидЦен);
		НаборЗаписей.Отбор.Номенклатура.Установить(ВыборкаДетальныеЗаписи.Номенклатура);
		НаборЗаписей.Отбор.Характеристика.Установить(ВыборкаДетальныеЗаписи.Характеристика);
		
		ПланыОбмена.ЗарегистрироватьИзменения(УзелИнформационнойБазы, НаборЗаписей);
	КонецЦикла;
	
	Если НЕ ТолькоЦенаИКоличество Тогда
		НаборЗаписей = РегистрыСведений.ХешКонтролируемыхРеквизитовДляМагазинаСоцСетей.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ОстаткиТоваровМагазинаСоцСетей.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура АвторизацияВКонтактеПараметрыВБезопасноеХранилищеЗаписать( УчетнаяЗапись, АвторизацияПараметры ) Экспорт

	Ключи = ИнтеграцияСМагазинамиСоцСетейКлиентСервер.АвторизацияВКонтактеБезопасноеХранилищеКлючиПолучить( АвторизацияПараметры.СпособАвторизации );
	ДанныеДляЗаписи = Новый Структура( Ключи );
	ЗаполнитьЗначенияСвойств( ДанныеДляЗаписи, АвторизацияПараметры );
	
	УстановитьПривилегированныйРежим(Истина);
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(УчетнаяЗапись, ДанныеДляЗаписи, Неопределено);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура АвторизацияВКонтактеПараметрыИзБезопасногоХранилищеПолучить( УчетнаяЗапись, АвторизацияПараметры ) Экспорт

	Ключи = ИнтеграцияСМагазинамиСоцСетейКлиентСервер.АвторизацияВКонтактеБезопасноеХранилищеКлючиПолучить( АвторизацияПараметры.СпособАвторизации );
	УстановитьПривилегированныйРежим(Истина);
	ДанныеИзБезопасногоХранилища = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(УчетнаяЗапись, Ключи);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ТипЗнч( ДанныеИзБезопасногоХранилища ) <> Тип( "Структура" ) Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьЗначенияСвойств( АвторизацияПараметры, ДанныеИзБезопасногоХранилища );
	
КонецПроцедуры

#КонецОбласти
